# ReferenceCategoryId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationType..::..ReferenceCategoryId Property
MultiReferenceAnnotationType Class See Also
---
The category of elements to which this annotation applies.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId ReferenceCategoryId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ReferenceCategoryId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ReferenceCategoryId {
	ElementId^ get ();
}
```

# Remarks
The TagTypeId will be cleared because the user must set a new tag type of an appropriate category.
# See Also
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace